Revit 2024 API
StructuralSection.GetEnumerator Method
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator
Visual C++
public:
virtual IEnumerator^ GetEnumerator()
Implements
IEnumerable.GetEnumerator()
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace